# ExportSizeTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableManager..::..ExportSizeTable Method
FamilySizeTableManager Class See Also
---
Exports the size table to aCSV file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ExportSizeTable(
	string tableName,
	string filePath
)
```

Visual Basic
---
```text
Public Function ExportSizeTable ( _
	tableName As String, _
	filePath As String _
) As Boolean
```

Visual C++
---
```text
public:
bool ExportSizeTable(
	String^ tableName,
	String^ filePath
)
```

# ### Parameters
tableName
    Type: System..::..String The bool name to export.
filePath
    Type: System..::..String The CSV file to export to.
# ### Return Value
True if successful, false otherwise..
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace